# FoCS Project 2019/ - Matteo Licciardello mat. 799368

### Import libraries and data

In [1]:
import pandas as pd
import numpy as np

In [2]:
loans_lenders = pd.read_csv('C:/Users/matal/Desktop/loans_lenders.csv')

In [3]:
loans_lenders.head()

   loan_id                                            lenders
0   483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1   483738  muc888, nora3555, williammanashi, barbara5610,...
2   485000  muc888, terrystl, richardandsusan8352, sherri4...
3   486087  muc888, james5068, rudi5955, daniel9859, don92...
4   534428  muc888, niki3008, teresa9174, mike4896, david7...

### 1) Normalize the loan_lenders table. In the normalized table, each row must have one loan_id and one lender

In [4]:
#Conversione lenders in lista di elementi

tmp = loans_lenders.lenders.str.split(", ")
loans_lenders['lenders'] = tmp
loans_lenders

         loan_id                                            lenders
0         483693  [muc888, sam4326, camaran3922, lachheb1865, re...
1         483738  [muc888, nora3555, williammanashi, barbara5610...
2         485000  [muc888, terrystl, richardandsusan8352, sherri...
3         486087  [muc888, james5068, rudi5955, daniel9859, don9...
4         534428  [muc888, niki3008, teresa9174, mike4896, david...
...          ...                                                ...
1387427   678999  [michael43411218, carol5987, gooddogg1, chris4...
1387428  1207353  [rjhoward1986, jeffrey6870, trolltech4460, ely...
1387429  1206220  [vicky7746, gooddogg1, fairspirit, craig972996...
1387430  1206425  [rich6705, sergiiy9766, angela7509, barbara561...
1387431  1206486                            [alan5175, amy38101311]

[1387432 rows x 2 columns]

In [5]:
## Creazione Dataframe con ogni riga corrispondente ad un lender

loans_lenders = loans_lenders.explode('lenders')
pd.DataFrame(loans_lenders)
loans_lenders

         loan_id            lenders
0         483693             muc888
0         483693            sam4326
0         483693        camaran3922
0         483693        lachheb1865
0         483693        rebecca3499
...          ...                ...
1387430  1206425  trogdorfamily7622
1387430  1206425          danny6470
1387430  1206425            don6118
1387431  1206486           alan5175
1387431  1206486        amy38101311

[28293931 rows x 2 columns]

In [6]:
## Dump dataframe
#loans_lenders.to_csv('C:/Users/matal/Desktop/loans_lenders_1.csv', index=False)
## Read dataframe

### 2) For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing

In [7]:
loans_lenders = pd.read_csv('C:/Users/matal/Desktop/loans_lenders_1.csv')
loans_lenders

          loan_id            lenders
0          483693             muc888
1          483693            sam4326
2          483693        camaran3922
3          483693        lachheb1865
4          483693        rebecca3499
...           ...                ...
28293926  1206425  trogdorfamily7622
28293927  1206425          danny6470
28293928  1206425            don6118
28293929  1206486           alan5175
28293930  1206486        amy38101311

[28293931 rows x 2 columns]

### 3) Find the lenders that have funded at least twice

### 4) For each country, compute how many loans have involved that country as borrowers.

### 5) For each country, compute the overall amount of money borrowed.

### 6) Like the previous point, but expressed as a percentage of the overall amount lent.

### 7) Like the three previous points, but split for each year (with respect to disburse time).

### 8) For each lender, compute the overall amount of money lent. For each loan that has more than one lender, you must assume that all lenders contributed the same amount.

### 9) For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed. Since the country of the lender is often unknown, you can assume that the true distribution among the countries is the same as the one computed from the rows where the country is known.

### 10) Which country has the highest ratio between the difference computed at the previous point and the population?

### 11) Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?

### 12) For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016, planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04 for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.